# -*- org-confirm-babel-evaluate: nil -*-
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:3
#+LANGUAGE: en-us
#+HTML_DOCTYPE: html5
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
#+HTML_HEAD: <style>blockquote p:last-child, div.figure p {margin: 0;}</style>
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper,12pt]
#+LATEX_HEADER: \usepackage[english]{babel}
#+LATEX_HEADER: \renewcommand{\familydefault}{\sfdefault}
#+LATEX_HEADER: \usepackage{helvet}
#+LATEX_HEADER: \usepackage[margin=1in]{geometry}
#+LATEX_HEADER: \usepackage{parskip}
#+LATEX_HEADER: \usepackage{tabularx}
#+LATEX_HEADER: \usepackage{float}
#+LATEX_HEADER: \usepackage{color}
#+LATEX_HEADER: \usepackage{titlesec}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \usepackage[document]{ragged2e}
#+LATEX_HEADER: \usepackage[T1]{fontenc}
#+LATEX_HEADER: \usepackage{sectsty}
#+LATEX_HEADER: \titleformat*{\section}{\LARGE\bfseries}
#+LATEX_HEADER: \titleformat*{\subsection}{\Large\bfseries}
#+LATEX_HEADER: \titleformat*{\subsubsection}{\large\bfseries}
#+LATEX_HEADER: \titleformat*{\paragraph}{\large\bfseries}
#+LATEX_HEADER: \titleformat*{\subparagraph}{\large\bfseries}
#+LATEX_HEADER: \renewcommand{\baselinestretch}{1.2}
#+LATEX_HEADER: \definecolor{light_grey}{RGB}{51,51,51}
#+LATEX_HEADER: \definecolor{bright_grey}{RGB}{249,249,249}
#+LATEX_HEADER: \definecolor{python_blue}{RGB}{41,128,185}
#+LATEX_HEADER: \hypersetup{colorlinks=true, urlcolor=python_blue, linkcolor=python_blue, citecolor=red}
#+LATEX_HEADER: \tolerance=1
#+LATEX_HEADER: \emergencystretch=\maxdimen
#+LATEX_HEADER: \hyphenpenalty=10000
#+LATEX_HEADER: \hbadness=10000
#+LATEX_HEADER: \makeatletter
#+LATEX_HEADER: \makeatother
#+LATEX_HEADER: \lstset{
#+LATEX_HEADER:   xleftmargin=0.5cm,frame=tlbr,framesep=4pt,framerule=0pt,
#+LATEX_HEADER:   columns=fullflexible,
#+LATEX_HEADER:   backgroundcolor=\color{white},
#+LATEX_HEADER:   basicstyle=\footnotesize\ttfamily,
#+LATEX_HEADER:   breakatwhitespace=false,
#+LATEX_HEADER:   breaklines=true,
#+LATEX_HEADER:   frame=single,
#+LATEX_HEADER:   keepspaces=true,
#+LATEX_HEADER:   rulecolor=\color{black},
#+LATEX_HEADER:   showspaces=false,
#+LATEX_HEADER:   showstringspaces=false,
#+LATEX_HEADER:   showtabs=false,
#+LATEX_HEADER:   stepnumber=2,
#+LATEX_HEADER:   tabsize=2,
#+LATEX_HEADER: }
#+LATEX_HEADER: \DeclareUnicodeCharacter{202F}{ }
#+LATEX: \frenchspacing
#+LATEX: \raggedright
#+TITLE: Guide: estimate cumulative incidence of disorder
#+AUTHOR: Richard Zetterberg <richard.zetterberg@regionh.dk>
#+PROPERTY: header-args:R :session *R* :tangle yes :shebang "#!/usr/bin/env Rscript"

#+LATEX: \clearpage

#+BEGIN_SRC R :exports none :tangle no
devtools::load_all(".")
source("./tests/utils.R")
#+END_SRC

#+RESULTS:

This is a guide for estimating cumulative incidence risk estimates of a single
disorder from TTE data.

All code shown in this guide have been written to [[./guide.R][this R file]], so that you don't have
to copy all code snippets manually.

There are 3 different things you can configure when running this pipeline:

- Study period
- Disorder to study
- Cohort to estimate the risk in

In this guide we are going to answer the following research question:
"What is the lifetime risk of schizophrenia in Danish millenials (born between 1981 and 1996)?"

We start by importing all the needed libraries:

#+BEGIN_SRC R :exports code :eval no
library(data.table)
library(dplyr)
library(dtplyr)
library(readr)
library(epimight)
#+END_SRC

* Arguments

** Study period

The first thing we need to do is to define the arguments that reflects the research question.
Since we want to study millenials, we will use the millenials start year as the start year of
the study:

#+BEGIN_SRC R :exports code
# Arguments for research question:
# What is the lifetime risk of schizophrenia in millenials (people born from 1981 to 1996)?

study_period_start <- as.Date("1981-01-01")
study_period_end   <- as.Date("2016-12-31")
#+END_SRC

#+RESULTS:
: 2016-12-31

The reason why we use ~2016-12-31~ as the end date, is because the registry data in the
~ibp-registry~ database ends at that date.

** Disorder to study

Next, we need to define what the earliest age of onset we want to use for
the disorder. Since we are studying schizophrenia, we are going to use 10:

#+BEGIN_SRC R :exports code
earliest_onset_age <- 10
#+END_SRC

#+RESULTS:
: 10

** Cohort to estimate the risk in

Next we define the millenials period (1981 to 1996) as the allowed date of birth:

#+BEGIN_SRC R :exports code
born_at_start <- as.Date("1981-01-01")
born_at_end   <- as.Date("1996-01-01")
#+END_SRC

#+RESULTS:
: 1996-01-01

* Data processing

Now that we have defined all arguments to use, it's time to read and process the
TTE data that we are going to analyze. The TTE data needs to fulfill the following
requirements in order to be used by this pipeline:

1. Each row represents an individual
2. Each individual can only appear once
3. The following columns *must* exist:
   - person_id :: A combination of letters/numbers that uniquely identifies an individual
   - failure_status :: Non-negative integer that can be 0, 1 or 2:
     - 0 :: Censoring
     - 1 :: Affected by disorder
     - 2 :: Competing risk
   - failure_time :: Non-negative integer that represents the age of the individual when the failure/event occured
4. Can contain any other column used in pre-analysis filtering

Since we are only studying millenials, our TTE data also needs to contain a column that
contains each individuals birth date. In this guide, we call this column ~born_at~.
The file format of the data is not important, what is important is that we can read the
data and convert into a ~data.table~.

The example data in this guide is contained in a file called ~tte_SCZ.csv~,
so we simply read it and convert it into a ~data.table~:

#+BEGIN_SRC R :eval no :exports code
tte <- read_csv("./tte_SCZ.csv") |> as.data.table()
#+END_SRC

#+BEGIN_SRC R :exports results :results output :tangle no
set.seed(6)
n_count <- 100000

tte <- generate_random_tte(n_count)
tte <- generate_failure(tte, 20, 10) |>
  select(-born_at_year, -dead_at_year, -relatives) |>
  as.data.table()
#+END_SRC

#+RESULTS:

Note that the example data in this guide contains 100000 randomly generated individuals:

- Born between ~1890-01-01~ and todays date
- Age of death from normal distribution, mean = ~68~, sd = ~8.2~
- Age of onset from normal distribution, mean = ~20~, sd = ~10~
- If death appears after study end, the following probablities of ~failure_status~:
  - censored (0) :: ~0.9~
  - affected (1) :: ~0.1~
- If death appears before study end, the following probablities of ~failure_status~:
  - affected (1) :: ~0.1~
  - competing risk (2) :: ~0.9~

After the data has been read, we need to apply our millenials filter to it:

#+BEGIN_SRC R :exports both :results output
tte <- tte |>
  filter(
    born_at >= born_at_start,
    born_at <= born_at_end
  )
#+END_SRC

#+RESULTS:

Here's what the filtered data looks like, note that we have less than 100000 individuals now
that we have filtered out non-millenials:

#+BEGIN_SRC R :exports both :results output
print(tte)
#+END_SRC

#+RESULTS:
#+begin_example
       person_id gender    born_at failure_status failure_time
    1:         4      f 1986-03-12              0           40
    2:         5      f 1990-10-10              0           36
    3:         9      m 1993-11-17              0           33
    4:        12      f 1992-04-02              0           34
    5:        33      m 1993-10-30              0           33
   ---
19804:     99977      f 1993-05-12              1           24
19805:     99981      f 1989-11-17              0           37
19806:     99982      m 1981-04-06              0           45
19807:     99984      f 1985-11-06              0           41
19808:    100000      f 1987-04-11              0           39
#+end_example

* Analysis

Now that we have the TTE data for schizophrenia in millenials, we can run the
actual analysis. Since we are going to produce cumulative incidence risk estimates,
we will use the class ~CumulativeIncidenceAnalysis~. We start out by creating the
instance:

#+BEGIN_SRC R :exports code
cif_analysis <- CumulativeIncidenceAnalysis$new()
#+END_SRC

#+RESULTS:

This class defaults to the age of onset range 1 to 100 years. In our case, we
want to use the range 10 to 100 years, therefor we need to provide both
the TTE data and the earliest onset age:

#+BEGIN_SRC R :exports code :results output
estimates <- cif_analysis$run(
  tte = tte,
  earliest_onset_age = earliest_onset_age
)
#+END_SRC

#+RESULTS:

And here's what the produced data looks like:

#+BEGIN_SRC R :exports both :results output
print(estimates)
#+END_SRC

#+RESULTS:
#+begin_example
    time         cif           se         l95         u95          var cases
 1:    1 0.002372779 0.0003457032 0.001695213 0.003050345 1.195107e-07    13
 2:    2 0.003029079 0.0003904696 0.002263773 0.003794385 1.524665e-07    27
 3:    3 0.003735864 0.0004334844 0.002886251 0.004585478 1.879087e-07    42
 4:    4 0.004493134 0.0004752121 0.003561735 0.005424533 2.258265e-07    64
 5:    5 0.005603796 0.0005304098 0.004564212 0.006643381 2.813346e-07    89
 6:    6 0.006865913 0.0005867374 0.005715929 0.008015897 3.442608e-07   133
 7:    7 0.009087237 0.0006742553 0.007765721 0.010408753 4.546201e-07   168
 8:    8 0.010854200 0.0007362406 0.009411195 0.012297205 5.420502e-07   198
 9:    9 0.012368740 0.0007853276 0.010829526 0.013907954 6.167394e-07   248
10:   10 0.014892973 0.0008606432 0.013206143 0.016579802 7.407067e-07   293
11:   11 0.017164782 0.0009228906 0.015355950 0.018973614 8.517271e-07   352
12:   12 0.020143376 0.0009982473 0.018186848 0.022099905 9.964977e-07   407
13:   13 0.022920032 0.0010633187 0.020835966 0.025004099 1.130647e-06   490
14:   14 0.027110258 0.0011539565 0.024848545 0.029371972 1.331616e-06   557
15:   15 0.030492730 0.0012216998 0.028098243 0.032887218 1.492550e-06   631
16:   16 0.034228595 0.0012918811 0.031696554 0.036760635 1.668957e-06   699
17:   17 0.037661551 0.0013527074 0.035010293 0.040312809 1.829817e-06   775
18:   18 0.041498384 0.0014171078 0.038720904 0.044275865 2.008195e-06   849
19:   19 0.045234249 0.0014766345 0.042340098 0.048128399 2.180449e-06   928
20:   20 0.049222536 0.0015371362 0.046209805 0.052235268 2.362788e-06   998
21:   21 0.052756462 0.0015883990 0.049643257 0.055869667 2.523011e-06  1086
22:   22 0.057199111 0.0016500443 0.053965084 0.060433139 2.722646e-06  1160
23:   23 0.060934976 0.0016996995 0.057603626 0.064266326 2.888978e-06  1231
24:   24 0.064519386 0.0017456353 0.061098004 0.067940768 3.047243e-06  1298
25:   25 0.067901858 0.0017875684 0.064398288 0.071405428 3.195401e-06  1359
26:   26 0.070981422 0.0018246333 0.067405206 0.074557637 3.329287e-06  1425
27:   27 0.074313409 0.0018636169 0.070660787 0.077966031 3.473068e-06  1493
28:   28 0.077746365 0.0019026387 0.074017262 0.081475468 3.620034e-06  1544
29:   29 0.080321082 0.0019311855 0.076536028 0.084106136 3.729478e-06  1599
30:   30 0.083097738 0.0019613146 0.079253632 0.086941844 3.846755e-06  1652
31:   31 0.085773425 0.0019897313 0.081873623 0.089673227 3.959031e-06  1712
32:   32 0.088803173 0.0020212186 0.084841658 0.092764689 4.085325e-06  1754
33:   33 0.091071848 0.0020462781 0.087061216 0.095082479 4.187254e-06  1797
34:   34 0.093569382 0.0020758004 0.089500888 0.097637876 4.308947e-06  1834
35:   35 0.095885377 0.0021051281 0.091759402 0.100011352 4.431564e-06  1863
36:   36 0.097860914 0.0021322552 0.093681771 0.102040058 4.546512e-06  1883
37:   37 0.099358986 0.0021548687 0.095135521 0.103582451 4.643459e-06  1896
38:   38 0.100439589 0.0021730272 0.096180534 0.104698644 4.722047e-06  1909
39:   39 0.101658760 0.0021962354 0.097354218 0.105963302 4.823450e-06  1921
40:   40 0.102949171 0.0022244513 0.098589327 0.107309015 4.948183e-06  1926
41:   41 0.103577622 0.0022405800 0.099186166 0.107969078 5.020199e-06  1931
42:   42 0.104327892 0.0022636926 0.099891136 0.108764648 5.124304e-06  1936
43:   43 0.105263652 0.0022996924 0.100756337 0.109770966 5.288585e-06  1939
44:   44 0.106018261 0.0023386691 0.101434554 0.110601968 5.469373e-06  1942
45:   45 0.107153050 0.0024257745 0.102398619 0.111907481 5.884382e-06  1942
    time         cif           se         l95         u95          var cases
#+end_example

* Next steps

The next natural step would be to estimate heritability for the disorder, since
cumulative incidence is used as inputs to the heritability calculation.

Heritability is done using the ~HeritabilityAnalysis~ class of this package. You
can either:

- Read the [[../heritability/index.org][reference documentation of ~HeritabilityAnalysis~]]
- Read the [[../heritability/guide.org][guide on how to estimate heritability for a single disorder]]
- Read the [[../heritability/guide-yob.org][guide on how to estimate heritability for a single disorder, stratified by birth year]]
